In [1]:
import pandas as pd
data=[10,20,30,40,50]
series=pd.Series(data)
print(series)

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [3]:
a=[1,7,2]
print(pd.Series(a,index=['x','y','z']))

x    1
y    7
z    2
dtype: int64

In [4]:
series.dtype

dtype('int64')

In [5]:
series.values

array([10, 20, 30, 40, 50], dtype=int64)

In [6]:
series.index

RangeIndex(start=0, stop=5, step=1)

In [7]:
print(series.values)

[10 20 30 40 50]

In [8]:
print(pd.Series([10,20,30,'abc']))

0     10
1     20
2     30
3    abc
dtype: object

In [11]:
series.name="num"
print(series)

0    10
1    20
2    30
3    40
4    50
Name: num, dtype: int64

In [12]:
series[0]

10

In [13]:
a=series>20
print(a)

0    False
1    False
2     True
3     True
4     True
Name: num, dtype: bool

In [14]:
a=series[series>20]
print(a)

2    30
3    40
4    50
Name: num, dtype: int64

In [15]:
series=series*2
print(series)

0     20
1     40
2     60
3     80
4    100
Name: num, dtype: int64

In [16]:
import numpy as np
square=np.sqrt(series)
print(square)

0     4.472136
1     6.324555
2     7.745967
3     8.944272
4    10.000000
Name: num, dtype: float64

In [17]:
series=series+10
print(series)

0     30
1     50
2     70
3     90
4    110
Name: num, dtype: int64

In [23]:
a=pd.Series(['a','b','c'])
print(a.dtype)

object

In [25]:
data={"calories":[420,380,390],"duration":[50,40,45]}
df=pd.DataFrame(data)
print(df)

   calories  duration
0       420        50
1       380        40
2       390        45

In [26]:
data={'state':['Ohio','Ohio','Ohio','Nevada','Nevada','Nevada'],
     'year':[2000,2001,2002,2003,2004,2005],
     'pop':[1.2,1.5,2.3,4.2,8.5,2.3]}
df=print(pd.DataFrame(data))

    state  year  pop
0    Ohio  2000  1.2
1    Ohio  2001  1.5
2    Ohio  2002  2.3
3  Nevada  2003  4.2
4  Nevada  2004  8.5
5  Nevada  2005  2.3

In [28]:
df=pd.DataFrame(data,columns=['pop','year','state'])
print(df)

   pop  year   state
0  1.2  2000    Ohio
1  1.5  2001    Ohio
2  2.3  2002    Ohio
3  4.2  2003  Nevada
4  8.5  2004  Nevada
5  2.3  2005  Nevada

In [29]:
df=pd.DataFrame(data,columns=['pop','year','state','debt'],index=['a','b','c','d','e','f'])
print(df)

   pop  year   state debt
a  1.2  2000    Ohio  NaN
b  1.5  2001    Ohio  NaN
c  2.3  2002    Ohio  NaN
d  4.2  2003  Nevada  NaN
e  8.5  2004  Nevada  NaN
f  2.3  2005  Nevada  NaN

In [30]:
print(df['pop'])

a    1.2
b    1.5
c    2.3
d    4.2
e    8.5
f    2.3
Name: pop, dtype: float64

In [31]:
print(df['state'])

a      Ohio
b      Ohio
c      Ohio
d    Nevada
e    Nevada
f    Nevada
Name: state, dtype: object

In [32]:
print(df.state)

a      Ohio
b      Ohio
c      Ohio
d    Nevada
e    Nevada
f    Nevada
Name: state, dtype: object

In [33]:
print(df.loc['b'])

pop       1.5
year     2001
state    Ohio
debt      NaN
Name: b, dtype: object

In [35]:
print(df.loc[['c','d']])

   pop  year   state debt
c  2.3  2002    Ohio  NaN
d  4.2  2003  Nevada  NaN

In [36]:
df['debt']=1.5
print(df)

   pop  year   state  debt
a  1.2  2000    Ohio   1.5
b  1.5  2001    Ohio   1.5
c  2.3  2002    Ohio   1.5
d  4.2  2003  Nevada   1.5
e  8.5  2004  Nevada   1.5
f  2.3  2005  Nevada   1.5

In [38]:
import numpy as np
df['debt']=np.arange(6)
print(df)

   pop  year   state  debt
a  1.2  2000    Ohio     0
b  1.5  2001    Ohio     1
c  2.3  2002    Ohio     2
d  4.2  2003  Nevada     3
e  8.5  2004  Nevada     4
f  2.3  2005  Nevada     5

In [39]:
val = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])
df['debt'] = val
print(df)

   pop  year   state  debt
a  1.2  2000    Ohio   NaN
b  1.5  2001    Ohio   NaN
c  2.3  2002    Ohio   NaN
d  4.2  2003  Nevada   NaN
e  8.5  2004  Nevada   NaN
f  2.3  2005  Nevada   NaN

In [41]:
df['eastern'] = df.state == 'Ohio'
print(df)

   pop  year   state  debt  eastern
a  1.2  2000    Ohio   NaN     True
b  1.5  2001    Ohio   NaN     True
c  2.3  2002    Ohio   NaN     True
d  4.2  2003  Nevada   NaN    False
e  8.5  2004  Nevada   NaN    False
f  2.3  2005  Nevada   NaN    False

In [42]:
print(df.T)

            a     b     c       d       e       f
pop       1.2   1.5   2.3     4.2     8.5     2.3
year     2000  2001  2002    2003    2004    2005
state    Ohio  Ohio  Ohio  Nevada  Nevada  Nevada
debt      NaN   NaN   NaN     NaN     NaN     NaN
eastern  True  True  True   False   False   False

In [48]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'a', 'b', 'c'])
print(obj)

d    4.5
a    7.2
b   -5.3
c    3.6
dtype: float64

In [45]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [47]:
obj3 = pd.Series(['blue', 'purple', 'red'], index=[0, 3, 4])
print(obj3)

0      blue
3    purple
4       red
dtype: object

In [49]:
obj4 = obj3.reindex(range(6), method='ffill') 
obj4

0      blue
1      blue
2      blue
3    purple
4       red
5       red
dtype: object

In [50]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
index=['Ohio', 'Dallas', 'NJ', 'New York'],
columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Dallas      4    5      6     7
NJ          8    9     10    11
New York   12   13     14    15

In [51]:
data.drop(['NJ', 'Ohio'])

          one  two  three  four
Dallas      4    5      6     7
New York   12   13     14    15

In [52]:
obj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
print(obj['c'])

2.0

In [53]:
obj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
print(obj[1:4])

b    1.0
c    2.0
d    3.0
dtype: float64

In [54]:
obj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
print(obj['a':'c'])

a    0.0
b    1.0
c    2.0
dtype: float64

In [55]:
obj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
print(obj[obj<3])

a    0.0
b    1.0
c    2.0
dtype: float64

In [56]:
data = pd.DataFrame(np.arange(24).reshape((6, 4)),
index=['Ohio', 'Dallas', 'Boston', 'NJ', 'New York', 'Austin'],columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Dallas      4    5      6     7
Boston      8    9     10    11
NJ         12   13     14    15
New York   16   17     18    19
Austin     20   21     22    23

In [58]:
data['three']

Ohio         2
Dallas       6
Boston      10
NJ          14
New York    18
Austin      22
Name: three, dtype: int32

In [60]:
data[1:3]

        one  two  three  four
Dallas    4    5      6     7
Boston    8    9     10    11

In [62]:
data.loc['Dallas',['two','three']]

two      5
three    6
Name: Dallas, dtype: int32

In [63]:
data.at['Dallas','two']

5

In [64]:
data.iloc[4]

one      16
two      17
three    18
four     19
Name: New York, dtype: int32

In [65]:
data.iloc[1:4,0:2]

        one  two
Dallas    4    5
Boston    8    9
NJ       12   13

In [66]:
print(data.three > 5)

Ohio        False
Dallas       True
Boston       True
NJ           True
New York     True
Austin       True
Name: three, dtype: bool

In [67]:
data[data.three > 5]

          one  two  three  four
Dallas      4    5      6     7
Boston      8    9     10    11
NJ         12   13     14    15
New York   16   17     18    19
Austin     20   21     22    23

In [68]:
data < 5
data[data < 5] = 0
data

          one  two  three  four
Ohio        0    0      0     0
Dallas      0    5      6     7
Boston      8    9     10    11
NJ         12   13     14    15
New York   16   17     18    19
Austin     20   21     22    23

In [69]:
data1=pd.DataFrame({'A':[1,2,3],'B':[4,5,6]})
data2=pd.DataFrame({'A':[7,8,9],'B':[10,11,12]})
print(data1+data2)

    A   B
0   8  14
1  10  16
2  12  18

In [70]:
data1=pd.DataFrame({'A':[1,2,3],'B':[4,5,6]})
data2=pd.DataFrame({'A':[7,8,9],'B':[10,11,12]})
print(data1*data2)

    A   B
0   7  40
1  16  55
2  27  72